In [34]:
import pandas as pd
import numpy as np
from sklearn import linear_model
import matplotlib.pyplot as plt
#from word2number import w2n

In [35]:
ds = pd.read_csv("hiring.csv")

In [36]:
ds

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [37]:
#from sklearn_pandas import CategoricalImputer
 
# handling NaN values
#imputer = CategoricalImputer()
#imputer.fit_transform(ds)
mode_value = ds['experience'].mode()[0]
ds['experience'].fillna(mode_value, inplace=True)

In [49]:
import math
median_test_score = math.floor(ds['test_score(out of 10)'].mean())
median_test_score

7

In [50]:
ds['test_score(out of 10)'] = ds['test_score(out of 10)'].fillna(median_test_score)

#ds.fillna(ds['test_score(out of 10)'].median(),inplace=True)
dic = {'one':1,'two':2,'three':3,'four':4,'five':5,'six':6,'seven':7,'eight':8,'nine':9,'ten':10,'eleven':11}
ds['experience'] = ds['experience'].replace(dic)
#ds.experience = ds.experience.apply(w2n.word_to_num)
ds

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          11                    8.0                           9      50000
1          11                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [51]:
from sklearn import linear_model
reg = linear_model.LinearRegression()
reg.fit(ds.drop('salary($)',axis="columns"),ds['salary($)'])

LinearRegression()

In [52]:
reg.predict([[7,9,6]])

C:\Users\asus\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([63305.25918232])

In [53]:
reg.coef_

array([-317.06165612,  -49.75922953, -108.11065999])

In [54]:
reg.intercept_

66621.18780096307

In [55]:
reg.score(ds.drop('salary($)',axis="columns"),ds['salary($)'])

0.009292090170695877